---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarCurvesData.GetRebarUpdateCurvesData
source: html/89fe31e2-42bb-7a25-caa3-6254b0105173.htm
---
# Autodesk.Revit.DB.Structure.RebarCurvesData.GetRebarUpdateCurvesData Method

Gets a class that contains information used as input and output for rebar free form calculation.

## Syntax (C#)
```csharp
public RebarUpdateCurvesData GetRebarUpdateCurvesData()
```

## Returns
Gets a class that contains information used as input and output for rebar free form calculation.